benchmarks/lora/definitive_results/performance_analysis/memory_overhead/llama-2-13b/mean_dataset/_1_32_/log_12923217.out
WARNING 12-11 22:07:32 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=59666, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/theory/S/llama-2-13b/mean_dataset/_1_32_', launch_server=True, server_args='--port=59666 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b --enable-lora --max-num-seqs=4096 --max-loras=1 --max-lora-rank=32', disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  183.78    
Total input tokens:                      250000    
Total generated tokens:                  231000    
Request throughput (req/s):              5.44      
Input token throughput (tok/s):          1360.34   
Output token throughput (tok/s):         1256.95   
---------------Time to First Token----------------
Mean TTFT (ms):                          80104.91  
Median TTFT (ms):                        74808.93  
P99 TTFT (ms):                           163239.41 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          85.53     
Median TPOT (ms):                        72.37     
P99 TPOT (ms):                           139.53    
---------------Inter-token Latency----------------
Mean ITL (ms):                           85.89     
Median ITL (ms):                         57.88     
P99 ITL (ms):                            300.78    
==================================================
Concurrent checker terminated
Server terminated